In [14]:
import pandas as pd
import numpy as np

In [15]:
sales={
    "name":["Amir", "Brain", "Calire" ,"Damian"],
    "n_sales":[178 , 128,75, 69]
}

In [16]:
sales_counts =pd.DataFrame(sales)

In [17]:
sales_counts

     name  n_sales
0    Amir      178
1   Brain      128
2  Calire       75
3  Damian       69

In [18]:
sales_counts.sample()

     name  n_sales
2  Calire       75

In [19]:
sales_counts.sample()

     name  n_sales
3  Damian       69

In [22]:
np.random.seed(10)
sales_counts.sample()

     name  n_sales
2  Calire       75

In [25]:
np.random.seed(10)
sales_counts.sample()

     name  n_sales
2  Calire       75

In [32]:
sales_counts.sample(2)

     name  n_sales
1   Brain      128
2  Calire       75

In [36]:
sales_counts.sample(5,replace=True)

     name  n_sales
2  Calire       75
2  Calire       75
1   Brain      128
0    Amir      178
0    Amir      178

## Independent events